; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=32, remove_proportion=0.2, bases=6, instance_id=18, output=./training, seed=59

(define (problem warehouse-18)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 - box
        base1 base2 base3 base4 base5 base6 - base
    )
    (:init
        (to-remove box1)
        (to-remove box3)
        (to-remove box15)
        (to-remove box21)
        (to-remove box30)
        (to-remove box32)
        (clear box27)
        (on box27 box21)
        (on box21 box31)
        (on box31 box24)
        (on box24 box4)
        (on box4 box28)
        (on box28 box20)
        (on box20 box7)
        (on-base box7 base1)
        (clear box13)
        (on box13 box18)
        (on box18 box1)
        (on box1 box29)
        (on-base box29 base2)
        (clear box2)
        (on box2 box25)
        (on box25 box26)
        (on box26 box12)
        (on box12 box16)
        (on box16 box22)
        (on-base box22 base3)
        (clear box8)
        (on box8 box9)
        (on box9 box10)
        (on-base box10 base4)
        (clear box15)
        (on box15 box19)
        (on box19 box6)
        (on box6 box11)
        (on box11 box32)
        (on-base box32 base5)
        (clear box3)
        (on box3 box5)
        (on box5 box30)
        (on box30 box14)
        (on box14 box17)
        (on box17 box23)
        (on-base box23 base6)
    )
    (:goal (and 
        (removed box1)
        (removed box3)
        (removed box15)
        (removed box21)
        (removed box30)
        (removed box32)
    ))
)

; plan
1. (move box13 box18 box2)
   deleted: (clear box2) (on box13 box18)
   added: (on box13 box2) (clear box18)
   goals met: 0 of 6
2. (move box18 box1 box13)
   deleted: (clear box13) (on box18 box1)
   added: (on box18 box13) (clear box1)
   goals met: 0 of 6
3. (remove box1 box29)
   deleted: (on box1 box29) (clear box1)
   added: (removed box1) (clear box29)
   goals met: 1 of 6
4. (remove box15 box19)
   deleted: (on box15 box19) (clear box15)
   added: (removed box15) (clear box19)
   goals met: 2 of 6
5. (move box19 box6 box18)
   deleted: (clear box18) (on box19 box6)
   added: (on box19 box18) (clear box6)
   goals met: 2 of 6
6. (move box27 box21 box19)
   deleted: (clear box19) (on box27 box21)
   added: (on box27 box19) (clear box21)
   goals met: 2 of 6
7. (remove box21 box31)
   deleted: (on box21 box31) (clear box21)
   added: (removed box21) (clear box31)
   goals met: 3 of 6
8. (move box6 box11 box27)
   deleted: (clear box27) (on box6 box11)
   added: (on box6 box27) (clear box11)
   goals met: 3 of 6
9. (move box11 box32 box29)
   deleted: (clear box29) (on box11 box32)
   added: (on box11 box29) (clear box32)
   goals met: 3 of 6
10. (remove box3 box5)
   deleted: (on box3 box5) (clear box3)
   added: (removed box3) (clear box5)
   goals met: 4 of 6
11. (move box5 box30 box11)
   deleted: (clear box11) (on box5 box30)
   added: (on box5 box11) (clear box30)
   goals met: 4 of 6
12. (remove box30 box14)
   deleted: (on box30 box14) (clear box30)
   added: (removed box30) (clear box14)
   goals met: 5 of 6
13. (remove-from-base box32 base5)
   deleted: (on-base box32 base5) (clear box32)
   added: (removed box32) (clear-base base5)
   goals met: 6 of 6
